src/cf/InformationRegisters/ObjectsUnregisteredDuringLoop.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ObjectsUnregisteredDuringLoop</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>InformationRegisterName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>InformationRegisterChanges</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ObjectPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>InfobaseNode</Name>
					<Comment>АПК:1330 универсальный механизм</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Comment>АПК:1330 универсальный механизм</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>InformationRegisterKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ObjectsUnregisteredDuringLoop/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

Procedure RegisterEverything(Schema, Settings) Export
	
	TemplateComposer = New DataCompositionTemplateComposer();
	CompositionTemplate = TemplateComposer.Execute(Schema, Settings, , ,Type("DataCompositionValueCollectionTemplateGenerator"));
	
	Query = New Query;
	QueryText = CompositionTemplate.DataSets.DynamicListDataSet.Query;
	
	SchemaQuery = New QuerySchema;
	SchemaQuery.SetQueryText(QueryText);
	
	SelectedFields = SchemaQuery.QueryBatch[0].Operators[0].SelectedFields;
	SelectedFields.Add("InfoRegisterObjectsUnregisteredWhileLooping.InformationRegisterName");
	SelectedFields.Add("InfoRegisterObjectsUnregisteredWhileLooping.InformationRegisterChanges");
	
	Query.Text = SchemaQuery.GetQueryText();
	
	For Each ParameterValue In CompositionTemplate.ParameterValues Do
		Query.SetParameter(ParameterValue.Name,ParameterValue.Value);
	EndDo;
	
	Selection = Query.Execute().Select();
	While Selection.Next() Do	
		RegisterAndDeleteRecords(Selection);
	EndDo;
		
EndProcedure

Procedure RegisterSelected(Address) Export
	
	ObjectsTable = GetFromTempStorage(Address);
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	ObjectsTable.InfobaseNode AS InfobaseNode,
		|	ObjectsTable.Object AS Object,
		|	ObjectsTable.InformationRegisterKey AS InformationRegisterKey
		|INTO TT_TableOfObjects
		|FROM
		|	&ObjectsTable AS ObjectsTable
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	Objects.InfobaseNode AS InfobaseNode,
		|	Objects.Object AS Object,
		|	Objects.InformationRegisterKey AS InformationRegisterKey,
		|	Objects.InformationRegisterName AS InformationRegisterName,
		|	Objects.InformationRegisterChanges AS InformationRegisterChanges
		|FROM
		|	TT_TableOfObjects AS TT_TableOfObjects
		|		LEFT JOIN InformationRegister.ObjectsUnregisteredDuringLoop AS Objects
		|		ON TT_TableOfObjects.InfobaseNode = Objects.InfobaseNode
		|			AND TT_TableOfObjects.Object = Objects.Object
		|			AND TT_TableOfObjects.InformationRegisterKey = Objects.InformationRegisterKey";
	
	Query.SetParameter("ObjectsTable", ObjectsTable);
	
	Selection = Query.Execute().Select();
	While Selection.Next() Do	
		RegisterAndDeleteRecords(Selection);
	EndDo;
		
EndProcedure

Procedure RegisterAndDeleteRecords(Parameters)
	
	If ValueIsFilled(Parameters.Object) Then
			
		ExchangePlans.RecordChanges(Parameters.InfobaseNode, Parameters.Object);
		
	Else
		
		RegisterName = Parameters.InformationRegisterName;
		Filter = Parameters.InformationRegisterChanges.Get();
		
		Set = InformationRegisters[RegisterName].CreateRecordSet();
		
		For Each Dimension In Metadata.InformationRegisters[RegisterName].Dimensions Do
			Set.Filter[Dimension.Name].Set(Filter[Dimension.Name]);	
		EndDo;
		
		Set.Read();
		
		ExchangePlans.RecordChanges(Parameters.InfobaseNode, Set);
						
	EndIf;
	
	Record = InformationRegisters.ObjectsUnregisteredDuringLoop.CreateRecordManager();
	FillPropertyValues(Record, Parameters, "InfobaseNode,Object,InformationRegisterKey");
	Record.Read();
	Record.Delete();
	
EndProcedure

#EndRegion

#EndIf
